app/controllers/products_controller.rb

  def index
    @products = Product.order(created_at: :desc).page(params[:page]).per 5
---
SELECT "products".* FROM "products" ORDER BY "products"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"

    def update
      @products = Product.all
      @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]

    def delete
      @product = Product.find(params[:product_id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]